Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: ནོར་བུ་རིན་པོ་ཆེ་རྡོ་རྗེའི་སེང་གེས་གནོན་པའི་པད་མོའི་སྙིང་པོ་ཅན་དག་བཤམས་ཤིང་བཏིང་བ་སྟེ། གཞལ་མེད་ཁང་ཆེན་པོ་རྒྱལ་མཚན་སྣ་ཚོགས་དེའི་བ་གམ་མང་པོ་ཡང་། རིན་པོ་ཆེ་བསམ་གྱིས་མི་ཁྱབ་པ་ལས་བྱས་པ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་རྣམ་པར་བརྒྱན་པ། ཁ་དོག་བསམ་གྱིས་མི་ཁྱབ་པར་མཛེས་ཤིང་གཟུགས་ཡིད་དུ་འོང་བ་དག་གོ །
en: The celestial mansion Vicitra­dhvaja had many pinnacles made of countless jewels, displaying an array of various jewels that were beautiful, attractive, and delightful, with countless colors.

source: བཟའ་ཤིང་གི་ར་བ་ཀུན་ནས་བརྒྱན་པ་དེ། སྟེང་ནས་བླ་རེ་ཆེན་པོ་བརྒྱ་སྟོང་ཕྲག་བཅུས་ཀུན་ནས་ཁེབས་པ་སྟེ། འདི་ལྟར་གོས་ཀྱི་བླ་རེ་དང་ཁྲི་ཤིང་གི་བླ་རེ་དང་མེ་ཏོག་གི་བླ་རེ་དང་། ཕྲེང་བའི་བླ་རེ་དང་།
en: A million great canopies covered the Samanta­vyūha Park from above.

source: སྤོས་ཀྱི་བླ་རེ་དང་། ནོར་བུ་རིན་པོ་ཆེའི་བླ་རེ་དང་། གསེར་གྱི་བླ་རེ་དང་། རྒྱན་གྱི་བླ་རེ་དང་། རིན་པོ་ཆེ་རྡོ་རྗེ་སྣང་བའི་བླ་རེ་དང་། གླང་པོའི་ཤུགས་དང་ལྡན་པས་སྤྲུལ་པའི་ལྷ་མོའི་བླ་རེ་དང་། ནོར་བུ་རིན་པོ་ཆེ་བརྒྱ་བྱིན་མངོན་པར་དགའ་བའི་བླ་རེ་དང་། དེ་དག་ལ་སོགས་པ་བླ་རེ་བརྒྱ་སྟོང་ཕྲག་བཅུས་ཀུན་ནས་ཁེབས་པར་བྱས་པའོ། །
en: There were canopies of cloth, canopies of creepers, canopies of flowers, canopies of garlands, perfumed canopies, canopies of jewels, canopies of gold, canopies of adornments, canopies of shining diamond jewels, canopies of apsarases conjured by Airāvaṇa the king of elephants, canopies of the precious jewels that are worn by Śakra, and so on—a million such canopies completely covered the park.

source: རིན་པོ་ཆེའི་དྲ་བ་བརྒྱ་སྟོང་ཕྲག་བཅུས་ཀུན་ནས་ཡོག་པ་སྟེ། འདི་ལྟར་རིན་པོ་ཆེ་དམ་པའི་དྲིལ་བུའི་དྲ་བ་དང་། རིན་པོ་ཆེའི་གདུགས་ཀྱི་དྲ་བ་དང་། རིན་པོ་ཆེའི་འབྲུའི་དྲ་བ་དང་། མུ་ཏིག་རྒྱ་མཚོའི་སྙིང་པོའི་དྲ་བ་དང་། ནོར་བུ་རིན་པོ་ཆེ་བཻཌཱུརྱ་སྔོན་པོའི་དྲ་བ་དང་། སེང་གེའི་ཁྲི་ཤིང་གི་དྲ་བ་དང་།
en: The park was covered with a million precious networks.

source: ནོར་བུ་རིན་པོ་ཆེ་ཆུ་ཤེལ་གྱི་དྲ་བ་དང་། སྤོས་ཀྱི་གཟུགས་ཀྱི་དྲ་བ་དང་། རིན་པོ་ཆེའི་ཅོད་པན་དང་། རིན་པོ་ཆེའི་ཕྲེང་བའི་དྲ་བ་དང་། དེ་དག་ལ་སོགས་པ་རིན་པོ་ཆེའི་དྲ་བ་བརྒྱ་སྟོང་ཕྲག་བཅུས་ཀུན་ནས་ཡོག་པ།
en: There were networks of precious bells; networks of precious parasols; networks of precious images; networks of pearls, the essences of the sea; networks of precious blue beryl jewels; networks of lion-vine ornaments; networks of precious moonstone jewels; networks of perfumed shapes; networks of precious crowns; networks of precious strings of beads; and so on—a million such networks completely covered the park.

source: སྣང་བ་ཆེན་པོ་བརྒྱ་སྟོང་ཕྲག་བཅུས་ཀྱང་ཀུན་ནས་ཡོག་པ་སྟེ། འདི་ལྟར་ནོར་བུ་རིན་པོ་ཆེ་སྐར་མའི་འོད་ཟེར་གྱི་སྣང་བ་དང་།
en: The park was also covered with a million great radiances.

source: ནོར་བུ་རིན་པོ་ཉི་མའི་སྙིང་པོའི་སྣང་བ་དང་། ནོར་བུ་རིན་པོ་ཆེ་ཟླ་བའི་རྒྱལ་མཚན་གྱི་སྣང་བ་དང་། ནོར་བུ་རིན་པོ་ཆེ་སྤོས་ཀྱི་དུད་པ་འོད་འཕྲོ་བའི་སྣང་བ་དང་། ནོར་བུ་རིན་པོ་ཆེ་དཔལ་གྱི་སྙིང་པོའི་སྣང་བ་དང་། ནོར་བུ་རིན་པོ་ཆེ་པད་མོའི་སྙིང་པོའི་སྣང་བ་དང་། ནོར་བུ་རིན་པོ་ཆེ་སྐར་མའི་རྒྱལ་མཚན་གྱི་སྣང་བ་དང་། ནོར་བུ་རིན་པོ་ཆེ་སྒྲོན་མ་ཆེན་པོའི་སྣང་བ་དང་། ནོར་བུ་རིན་པོ་ཆེ་ཕྱོགས་ཀུན་ཏུ་རྣམ་པར་སྣང་བའི་སྣང་བ་དང་། ནོར་བུ་རིན་པོ་ཆེ་སྤོས་ཀྱི་སྤྲིན་ཆེན་པོ་དང་། ཀློག་གི་ཕྲེང་བ་འབྱུང་བའི་སྣང་བ་དང་། དེ་དག་ལ་སོགས་པ་ནོར་བུ་རིན་པོ་ཆེའི་སྣང་བ་ཆེན་པོ་བརྒྱ་སྟོང་ཕྲག་བཅུས་རྟག་ཏུ་སྣང་བར་བྱས་པའོ། །
en: There was the radiance of precious starlight jewels, the radiance of precious sunstones, the radiance of precious moon-banner jewels, the radiance of precious incense-smoke jewels, the radiance of precious lotus-essence jewels, the radiance of precious star-banner jewels, the radiance of precious great-lamp jewels, the radiance of precious all-illuminating jewels, the radiance of precious great-clouds-of-perfume jewels, the radiance of precious garlands-of-lightning jewels, and so on—a million such great radiances from precious jewels illuminated the park.

source: བཟའ་ཤིང་གི་ར་བ་དེ་ནི་རྒྱན་ཆེན་པོའི་སྤྲིན་བརྒྱ་སྟོང་ཕྲག་བཅུའི་ཆར་འབབ་པའི་རྒྱན་དང་ལྡན་པ་སྟེ། དུས་དང་མཐུན་པའི་ཙན་དན་གྱི་སྤྲིན་བརྒྱ་སྟོང་ཕྲག་བཅུའི་འབྲུག་སྒྲ་རབ་ཏུ་འབྱུང་བ། ལྷ་རྫས་ལས་འདས་པའི་ཕྲེང་བ་དང་། ལྡ་ལྡིའི་སྤྲིན་ཆེན་པོ་ཀུན་ཏུ་མཆེད་པས་རབ་ཏུ་བརྒྱན་པ། ལྷ་རྫས་ལས་འདས་པའི་གོས་ཚོན་སྣ་ཚོགས་དང་ལྡན་པའི་སྤྲིན་བརྒྱ་སྟོང་ཕྲག་བཅུའི་སྤྲིན་མངོན་པར་འབབ་པ། ལྷ་རྫས་ལས་འདས་པའི་རྒྱན་གྱི་སྤྲིན་བརྒྱ་སྟོང་ཕྲག་བཅུས་རྣམ་པར་ཀླུབས་པ། ལྷའི་བུ་བརྒྱ་སྟོང་ཕྲག་བཅུ་མཐོང་བར་དགའ་སྟེ། འོག་ཏུ་ལྟ་ཞིང་རབ་ཏུ་འདུད་པའི་ཕྱག་ཆར་བཞིན་དུ་འབབ་པ། ལྷ་མོའི་སྤྲིན་བརྒྱ་སྟོང་ཕྲག་བཅུ་སྔོན་གྱི་སྤྱོད་པའི་སྐལ་བ་མཉམ་པས་རང་རང་གི་ལུས་འབུལ་བའི་ཆར་མངོན་པར་འབབ་པ། བྱང་ཆུབ་སེམས་དཔའི་སྤྲིན་བརྒྱ་སྟོང་ཕྲག་བཅུ་ཆོས་མཉན་པས། སྐོམ་ཞིང་འོང་བའི་ཆར་མངོན་པར་འབབ་སྟེ།
en: In that park there were a million great clouds of adornments that rained down adornments; there was thunder from a million clouds of yellow sandalwood; there was the beauty of a million clouds of hanging garlands and wreaths that transcended those of the devas; there was the rain from a million clouds of various kinds of clothing that transcended those of the devas; there was the beautification from a million clouds of adornments that transcended those of the devas; there was a cloud of a million devas who, wishing to see, looked downward and bowed their bodies in a rainfall of homage; there was a cloud of a million apsarases, with the same extent of past conduct, who sent down a rain of the offering of their bodies; and there was a cloud of a million bodhisattvas listening to the Dharma and sending down a rain for those who are thirsty.

source: དེ་ན་དགེ་བསྙེན་མ་ཡིད་བཞིན་གསེར་གྱི་སྙིང་པོའི་ཁྲི་ཆེན་པོ་ལ་འདུག་ཅིང་། མུ་ཏིག་རྒྱ་མཚོའི་སྙིང་པོའི་དྲ་བས་བརྒྱན་པའི་ཅོད་པན་ཐོགས་པ། ལག་པ་ལ་ལྷ་རྫས་ལས་འདས་པའི་གསེར་གྱི་དཔུང་རྒྱན་དང་། གདུབ་བུ་ཐོགས་པ། ལག་པ་ནོར་བུ་རིན་པོ་ཆེ་དཔལ་གྱི་རང་བཞིན་གྱི་འོད་ཟེར་གྱིས་རྣམ་པར་མཛེས་པར་གྱུར་པ། རྣ་ཆ་རིན་པོ་ཆེ་མཐོན་ཏིང་དྲི་མ་མེད་པ་རབ་ཏུ་འཕྱང་བ། མགོ་ནོར་བུ་རིན་པོ་ཆེའི་དྲ་བས་མཛེས་པར་བརྒྱན་པ། ནོར་བུ་རིན་པོ་ཆེ་སེང་གེའི་གདོང་གི་རྣ་བའི་གོང་རྒྱན་ཐོགས་པ། ནོར་བུ་རིན་པོ་ཆེ་ཡིད་བཞིན་གྱི་རྒྱལ་པོའི་མགུལ་ཀོར་ཐོགས་པ། ལུས་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་དྲ་བས་ཡོག་ཅིང་འོད་རབ་ཏུ་འབར་བ།
en: The upāsikā Āśā was seated there on a great throne of the essence of gold, wearing a crown of a net of pearls, the essences of the sea; wearing on her arms gold armlets and bracelets transcending those of the devas; her arms adorned by precious jewels shining with glorious light rays; wearing precious, stainless, dark blue pendant earrings; her head beautifully adorned by a net of precious jewels; wearing precious lion-face jewels on the upper part of her ears; wearing a necklace of precious king of wish-fulfilling jewels at her throat; her body covered in a brightly shining net of all jewels.

source: སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་གི་ལུས་རབ་ཏུ་བཏུད་དེ། ཕྱག་བྱ་བ་ཞིག་འདུག་སྟེ། དགེ་བསྙེན་མ་ཡིད་བཞིན་དེའི་དྲུང་དུ་ཤར་ཕྱོགས་ནས་ཚངས་པ་ཆེན་པོའམ། ཚངས་ལྷ་ཉེ་ཕན་དང་། ཚངས་པའི་རིས་སུ་གཏོགས་པའམ། དབང་བྱེད་དམ། གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་རིས་སུ་གཏོགས་པའམ། རབ་འཕྲུལ་དགའ་འམ། འཕྲུལ་དགའི་རིས་སུ་གཏོགས་པའམ། རབ་དགའ་ལྡན་ནམ། དགའ་ལྡན་གྱི་རིས་སུ་གཏོགས་པ་འམ། རབ་མཚེ་མ་འམ། མཚེ་མའི་རིས་སུ་གཏོགས་པའམ། ལྷའི་དབང་པོ་འམ། སུམ་ཅུ་རྩ་གསུམ་གྱི་རིས་སུ་གཏོགས་པའམ། གནོད་སྦྱིན་གྱི་དབང་པོའམ། གནོད་སྦྱིན་ནམ། དྲི་ཟའི་དབང་པོའམ། དྲི་ཟ་འམ། གྲུལ་བུམ་གྱི་དབང་པོའམ། གྲུལ་བུམ་འམ།
en: A quintillion beings were bowing down to her in homage.

source: ཀླུའི་དབང་པོ་འམ། ཀླུའམ། ལྷ་མ་ཡིན་གྱི་དབང་པོའམ། ལྷ་མ་ཡིན་ནམ། ནམ་མཁའ་ལྡིང་གི་དབང་པོའམ། ནམ་མཁའ་ལྡིང་ངམ། མིའམ་ཅིའི་དབང་པོའམ། མི་འམ་ཅི་འམ། ལྟོ་འཕྱེ་ཆེན་པོའི་དབང་པོའམ། ལྟོ་འཕྱེ་ཆེན་པོ་འམ། གཤིན་རྗེ་འམ། གཤིན་རྗེའི་བུ་མོ་འམ། ཡི་དགས་རྫུ་འཕྲུལ་ཆེན་པོའམ། ཡི་དགས་སམ། མིའི་དབང་པོའམ། མིའང་རུང་སྟེ།
en: In front of this upāsikā, there came from the eastern direction countless, innumerable beings: Mahābrahmās, court priests of Brahmās, and Brahmakāyika devas, Vaśavartins and Para­nirmita­vaśa­vartin devas, Sunirmitas and Nirmāṇarati devas, Saṃtuṣitas and Tuṣita devas, Suyāmas and Yāma devas, Devendra and Trāyastriṃśa devas, lords of yakṣas and yakṣas, lords of gandharvas and gandharvas, lords of kumbhāṇḍas and kumbhāṇḍas, lords of nāgas and nāgas, lords of asuras and asuras, lords of garuḍas and garuḍas, lords of kinnaras and kinnaras, lords of mahoragas and mahoragas, Yamas and Yama daughters, pretas with great power and pretas, and lords of humans and humans.

source: སེམས་ཅན་ཚད་མེད་གྲངས་མེད་པ་དག་འོང་བ་དང་། དེ་བཞིན་དུ་ལྷོ་ཕྱོགས་དང་། ནུབ་ཕྱོགས་དང་། བྱང་ཕྱོགས་དང་། བྱང་ཤར་གྱི་ཕྱོགས་མཚམས་དང་། ཤར་ལྷོའི་ཕྱོགས་མཚམས་དང་། ལྷོ་ནུབ་ཀྱི་ཕྱོགས་མཚམས་དང་། ནུབ་བྱང་གི་ཕྱོགས་མཚམས་དང་། འོག་དང་སྟེང་གི་ཕྱོགས་ནས་ཀྱང་། ཚངས་པ་ཆེན་པོའམ། ཚངས་ལྷ་ཉེ་ཕན་ནམ། ཚངས་པའི་རིས་སུ་གཏོགས་པའམ། དབང་བྱེད་དམ། དབང་བྱེད་ཀྱི་རིས་སུ་གཏོགས་པ་ནས། མིའི་དབང་པོའམ། མིའི་བར་གྱི་སེམས་ཅན་མང་པོ་འོང་བ། དེ་དག་ནད་སྣ་ཚོགས་ཞིག་གིས་བཏབ་པའམ། ཉོན་མོངས་པ་སྣ་ཚོགས་ཀྱིས་ཀུན་ནས་འཁོར་ཏམ། ལྟ་བའི་རྣམ་པ་སྣ་ཚོགས་ལ་མངོན་པར་ཞེན་ཏམ། ལས་ཀྱི་སྒྲིབ་པས་བསྒྲིབས་པ་ཞིག་ཡོད་ནའང་། དེ་དག་གིས་དགེ་བསྙེན་མ་ཡིད་བཞིན་དེ་མཐོང་མ་ཐག་ཏུ་ནད་ཐམས་ཅད་ཀྱང་རབ་ཏུ་ཞི་བར་གྱུར། སེམས་ཅན་གྱི་ཉོན་མོངས་པའི་དྲི་མ་དང་ཡང་བྲལ་བར་གྱུར། ལྟ་བའི་གསལ་ཤིང་ཡང་ཕྱིན་པར་གྱུར། སྒྲིབ་པའི་རི་ཐམས་ཅད་ཀྱང་རྣམ་པར་བཤིག་པར་གྱུར། རྣམ་པར་དག་པའི་དཀྱིལ་འཁོར་བསྒྲིབས་པ་མེད་པ་ཡང་ཁོང་དུ་ཆུད་པར་གྱུར་ཏེ།
en: In the same way, from the south, the west, the north, the northeast, the southeast, the southwest, the northwest, above, and below there came many beings: Mahābrahmās, court priests of Brahmās, Brahmakāyika devas, Vaśavartins, Para­nirmita­vaśa­vartin devas, and so on, up to lords of humans and humans.

source: རྣམ་པར་དག་པའི་དཀྱིལ་འཁོར་དེ་ཡོད་པས་ནི་དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཀྱང་རབ་ཏུ་བྱང་བར་གྱུར། དབང་པོའི་མྱུ་གུ་ཐམས་ཅད་ཀྱང་རྣམ་པར་འཕེལ་བར་གྱུར། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་ཚུལ་རྒྱ་མཚོ་ལ་ཡང་དག་པར་གཞོལ་བར་གྱུར། གཟུངས་ཀྱི་སྒོ་རྒྱ་མཚོ་ཐམས་ཅད་ལའང་འཇུག་པར་གྱུར། ཏིང་ངེ་འཛིན་གྱི་སྒོ་དང་ཚུལ་རྒྱ་མཚོ་ཐམས་ཅད་ཀྱང་མངོན་སུམ་དུ་གྱུར། སྨོན་ལམ་གྱི་སྒོ་ཐམས་ཅད་ཀྱང་ཡང་དག་པར་སྐྱེ་བར་གྱུར། སྤྱོད་པའི་སྒོ་ཐམས་ཅད་ཀྱང་རབ་ཏུ་བྱུང་བར་གྱུར། ཡོན་ཏན་མངོན་པར་བསྒྲུབ་པའི་སྒོ་ཐམས་ཅད་ཀྱང་རྣམ་པར་དག་པར་གྱུར།
en: All those who suffered from various illnesses, were mired in various kleśas, were attached to various wrong views, or were obscured by karmic obscurations, as soon as they saw Upāsikā Āśā, were healed of their illnesses, became freed from the kleśas that stained their minds, departed from their erroneous views, had all their mountains of obscurations destroyed, and entered the pure field of freedom from obscurations, and within that pure field they purified all their roots of merit, caused all the seedlings of their faculties to grow, became dedicated to the ocean of the way of omniscient wisdom, entered the entire ocean of the gateways to the power of retention, faced the entire ocean of the gateways of samādhis, developed all the gateways of prayer, gave rise to all the gateways of conduct, purified all the gateways of the accomplishment of qualities, gave rise to the ways of all the clairvoyances of a vast mind, and could go anywhere with unimpeded bodies.

source: སེམས་རྒྱ་ཆེན་པོ་ཡང་མངོན་པར་ཤེས་པ་ཐམས་ཅད་དང་ལྡན་པའི་ཚུལ་དུ་བྱུང་བར་གྱུར། ལུས་ཐོགས་པ་མེད་པས་ཀྱང་ཐམས་ཅད་དུ་རྗེས་སུ་འགྲོ་བར་གྱུར་ཏོ། །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་བཟའ་ཤིང་གི་ར་བ་ཀུན་ནས་རྣམ་པར་བརྒྱན་པའི་ནང་དུ་ཕྱིན་ཏེ་བལྟས་ནས། དགེ་བསྙེན་མ་ཡིད་བཞིན་ཁྲི་བཟང་པོ་ལ་འདུག་པ་མཐོང་ནས།
en: Then Sudhana, the head merchant’s son, entered the Samanta­vyūha Park, looked around at everything, and saw the upāsikā Āśā seated on a magnificent throne.

source: དེ་དགེ་བསྙེན་མ་ཡིད་བཞིན་གང་ན་བ་དེར་སོང་སྟེ། ཕྱིན་ནས་དགེ་བསྙེན་མ་ཡིད་བཞིན་གྱི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ།
en: He approached the upāsikā Āśā and, having reached her, bowed his head to the feet of the upāsikā Āśā.

source: དགེ་བསྙེན་མ་ཡིད་བཞིན་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་མ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་མ་འཚལ་ཏེ།
en: He circumambulated her, keeping her to his right, many hundreds of thousands of times and then said, “Āryā, I have developed the aspiration for the highest, complete enlightenment, but I do not know how bodhisattvas should train in bodhisattva conduct and in what way they should practice it.

source: འཕགས་མ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་གདམས་ངག་དང་རྗེས་སུ་བསྟན་པ་མཛད་དོ། །ཞེས་ཐོས་ན།
en: Āryā, I have heard that you give instruction and teachings to bodhisattvas!

source: འཕགས་མ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་བདག་ལ་བཤད་དུ་གསོལ། །
en: I pray that you explain to me how bodhisattvas should train in bodhisattva conduct and how they should practice it!”

source: དེས་སྨྲས་པ་རིགས་ཀྱི་བུ་ཁོ་མོ་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་མྱ་ངན་མེད་པ་བདེ་བའི་རྒྱལ་མཚན་ཐོབ་པ་སྟེ། རིགས་ཀྱི་བུ་ཁོ་མོ་ནི་དེའི་མཐུས་མཐོང་ན་དོན་ཡོད་པའོ། །
en: The upāsikā Āśā said, “Noble one, I have attained the bodhisattva liberation called the banner of bliss without sorrow.

source: མཉན་ན་དོན་ཡོད་པའོ། །རིམ་གྲོར་བྱས་ན་དོན་ཡོད་པའོ། །གནས་གཅིག་ན་འགྲོགས་པ་དོན་ཡོད་པའོ། །རྗེས་སུ་དྲན་པར་བྱས་པ་དོན་ཡོད་པའོ། །
en: Noble one, through its power it is beneficial to see me, it is beneficial to hear me, it is beneficial to honor me, it is beneficial to be in one place with me, and it is beneficial to remember me.

source: རིགས་ཀྱི་བུ་ཁོ་མོ་ནི་སེམས་ཅན་དགེ་བའི་རྩ་བ་མ་བསྐྱེད་པ། དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་མ་ཟིན་པ། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་མ་དགོངས་པ་རྣམས་ཀྱིས་མཐོང་ཞིང་རྣམ་པར་དམིགས་པར་མིག་ལམ་དུ་འོང་བར་མི་འགྱུར་ཏེ།
en: “Noble one, when beings who have not developed the roots of merit, have not become pupils of a kalyāṇamitra, and have no intention to attain complete buddhahood look at me, I do not appear within their field of vision.

source: རིགས་ཀྱི་བུ་ཁོ་མོ་མཐོང་བ་ཙམ་གྱིས་ནི་སེམས་ཅན་རྣམས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་རོ། །
en: “Noble one, merely through seeing me, beings become irreversible on the path to the highest, complete enlightenment.

source: གཞན་ཡང་རིགས་ཀྱི་བུ་ཁོ་མོའི་དྲུང་དུ་ཤར་ཕྱོགས་ནས་དེ་བཞིན་གཤེགས་པ་དག་བྱོན་ཅིང་། གདན་རིན་པོ་ཆེའི་ཁྲི་འདི་ལ་བཞུགས་ནས་ཆོས་སྟོན་ཏོ། །
en: “Moreover, noble one, tathāgatas come from the east into my presence, and they sit on precious thrones and teach the Dharma.

source: ཤར་ཕྱོགས་ནས་ཇི་ལྟ་བ་བཞིན་དུ་ཕྱོགས་བཅུ་ནས་ཀྱང་དེ་བཞིན་ཏེ།
en: And just as they come from the east, they come in that way from the ten directions.

source: རིགས་ཀྱི་བུ་དེ་ལྟ་བས་ན། ཁོ་མོ་ནི་དེ་བཞིན་གཤེགས་པ་མཐོང་བ་དང་མི་འབྲལ་བའོ། །ཆོས་མཉན་པ་དང་མི་འབྲལ་བའོ། །
en: “Therefore, noble one, I am never without the sight of the tathāgatas, I am never without the teaching of the Dharma, and I am never without the company of bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའ་དང་འགྲོགས་པ་དང་མི་འབྲལ་བའོ། །རིགས་ཀྱི་བུ་ཁོ་མོ་དང་སྤྱོད་པའི་སྐལ་བ་མཉམ་བའི་སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་པོ་བཟའ་ཤིང་གི་ར་བ་ཀུན་ནས་རྣམ་པར་བརྒྱན་པ་འདི་ན་གནས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པ་ཤ་སྟག་གོ །
en: “Noble one, eighty-four hundred thousand quintillion beings who have the same level of conduct as me are present in this Samanta­vyūha Park.

source: རིགས་ཀྱི་བུ་སེམས་ཅན་གཞན་གང་འདི་ན་གནས་པ་དེ་དག་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པ།
en: They are all irreversibly progressing to the highest, complete enlightenment.

source: ཕྱིར་མི་ལྡོག་པའི་དགེ་འདུན་དུ་གཏོགས་པ་ཤ་སྟག་སྟེ། ཁོ་མོ་དང་སྤྱོད་པའི་སྐལ་བ་མཉམ་པ་དག་གོ །
en: “Noble one, all the other beings who are present here will also progress irreversibly to the highest, complete enlightenment and will be included within the irreversible saṅgha and have the same level of conduct as myself.”

source: སྨྲས་པ་ལས་འཕགས་མ་ཁྱོད་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡུན་ཇི་སྲིད་ཅི་གནས་ཐུགས་བསྐྱེད།
en: Sudhana asked, “Āryā, how long have you had the aspiration to attain the highest, complete enlightenment?”

source: སྨྲས་པ་རིགས་ཀྱི་བུ་ཁོ་མོ་ནི་སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་ནོ། །
en: The upāsikā Āśā answered, “Noble one, I remember my past lives.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་ཅེས་བྱ་བ་བྱུང་བ་དེ་བཞིན་གཤེགས་པ་དེའི་དྲུང་དུ་ཁོ་མོས་ཚངས་པའི་སྤྱོད་པ་སྤྱད་དོ། །
en: There was the tathāgata arhat samyak­saṃbuddha named Dīpaṅkara. I took the vows of celibacy in the presence of that tathāgata.

source: དེ་བཞིན་གཤེགས་པ་དེ་ཁོ་མོས་མཆོད་དོ། །
en: I made offerings to that tathāgata.

source: དེ་བཞིན་གཤེགས་པ་དེ་ལས་ཆོས་བསྟན་པ་ཁོ་མོས་ཡོངས་སུ་བཟུང་ངོ་། །
en: I obtained the teaching of the Dharma from that tathāgata.

source: དེའི་སྔ་རོལ་དུ་དེ་བཞིན་གཤེགས་པ་དྲི་མ་མེད་པ་ཞེས་བྱ་བ་བྱུང་སྟེ།
en: Before him there was a tathāgata named Vimala.

source: དེའི་བསྟན་པ་ལའང་ཁོ་མོ་རབ་ཏུ་བྱུང་ངོ་། །ཆོས་ཀྱི་འཁོར་ལོ་ཡང་ཁོ་མོས་བཟུང་ངོ་། །
en: I entered homelessness within his teaching, and I also obtained his wheel of the Dharma.

source: དེའི་སྔ་རོལ་དུ་དེ་བཞིན་གཤེགས་པ་དཔལ་ཞེས་བྱ་བ་བྱུང་སྟེ། དེ་ཡང་ཁོ་མོས་བསྙེན་བཀུར་ཏོ། །
en: Before him there was a tathāgata named Ketu, and I propitiated him.

source: དེའི་སྔ་རོལ་ཏུ་དེ་བཞིན་གཤེགས་པ་རི་རབ་དཔལ་ཞེས་བྱ་བ་བྱུང་ངོ་། །
en: Before him there was a tathāgata named Meruśrī.

source: དེའི་སྔ་རོལ་ཏུ་དེ་བཞིན་གཤེགས་པ་པད་མོའི་སྙིང་པོ་ཞེས་བྱ་བ་བྱུང་ངོ་། །
en: Before him there was a tathāgata named Padma­garbha.

source: དེའི་སྔ་རོལ་ཏུ་དེ་བཞིན་གཤེགས་པ་རྣམ་པར་སྣང་མཛད་ཅེས་བྱ་བ་བྱུང་ངོ་། །
en: Before him there was a tathāgata named Vairocana.

source: དེའི་སྔ་རོལ་ཏུ་དེ་བཞིན་གཤེགས་པ་ཀུན་ཏུ་གཟིགས་པ་ཞེས་བྱ་བ་བྱུང་ངོ་། །
en: Before him there was a tathāgata named Samanta­cakṣu.

source: དེའི་སྔ་རོལ་ཏུ་དེ་བཞིན་གཤེགས་པ་ཚངས་པ་དག་པ་ཞེས་བྱ་བ་བྱུང་ངོ་། །
en: Before him there was a tathāgata named Brahmaśuddha.

source: དེའི་སྔ་རོལ་ཏུ་དེ་བཞིན་གཤེགས་པ་རྡོ་རྗེའི་གཙུག་ཅེས་བྱ་བ་བྱུང་ངོ་། །དེའི་ཀུན་སྔ་རོལ་ཏུ་དེ་བཞིན་གཤེགས་པ་ཆུ་བོའི་ལྷ་ཞེས་བྱ་བ་བྱུང་སྟེ། རིགས་ཀྱི་བུ་གཞུང་དེ་ལྟར་ཚེ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་དང་། བསྐལ་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པའི་སངས་རྒྱས་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ།
en: Before him there was a tathāgata named Vajranābhi.

source: དེ་བཞིན་གཤེགས་པའི་མཚམས་འདབས་ཆགས་སུ་བསམས་ཏེ། དྲན་པར་བྱས་ན། གང་ཁོ་མོས་རིམ་གྲོར་བྱས་ཏེ།
en: Before him there was a tathāgata named Varuṇadeva.

source: བསྙེན་བཀུར་བ་དང་། མཆོད་པ་དང་། བསྟི་སྟང་དུ་བྱས་པ་དང་། གང་གི་སྤྱན་སྔར་ཁོ་མོས་ཆོས་ཐོས་པར་གྱུར་པ་དང་། གང་གི་བསྟན་པ་ལ་ཁོ་མོས་ཚངས་པའི་སྤྱོད་པ་སྤྱད་པའི་དེ་བཞིན་གཤེགས་པ་ཆུ་ཀླུང་གང་གཱ་སུམ་ཅུ་རྩ་དྲུག་གི་བྱེ་མ་སྙེད་རྗེས་སུ་དྲན་ཏེ།
en: “Noble one, in that way I think of and remember the continuous sequence of one life after another, one kalpa after another, and the successions of one buddha after another, remembering tathāgatas as numerous as the grains of sand in thirty-six Ganges Rivers, whom I served, propitiated, made offerings to, honored, and heard the Dharma from and within whose teaching I practiced the conduct of celibacy.

source: རིགས་ཀྱི་བུ་དེ་ཕན་ཅད་དུ་ཁོ་མོས་དེ་བཞིན་གཤེགས་པ་ཇི་སྙེད་ཅིག་བསྙེན་བཀུར་བ་ནི། དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱིས་མཁྱེན་ཏོ། །
en: “Noble one, the tathāgatas know how many tathāgatas beyond that I have honored.

source: རིགས་ཀྱི་བུ་སེམས་དང་པོ་བསྐྱེད་མ་ཐག་ཏུ་ཆོས་ཀྱི་དབྱིངས་རྒྱས་པར་འགེངས་པས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་ཚད་མེད་པའོ། །
en: “Noble one, the bodhisattvas are immeasurable because they fill the realm of phenomena through developing the aspiration for enlightenment for the first time.

source: རིགས་ཀྱི་བུ་སྙིང་རྗེ་ཆེན་པོའི་ཁོངས་སུ་འགྲོ་བ་ཐམས་ཅད་ཆུད་པས། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་ཚད་མེད་པའོ། །
en: “Noble one, the bodhisattvas are immeasurable because through great compassion they enter into all worlds.

source: རིགས་ཀྱི་བུ་སྨོན་ལམ་ཆེན་པོས་ཕྱོགས་བཅུའི་ཆོས་ཀྱི་དབྱིངས་ཀྱི་གཞི་ཟད་ཟད་དུ་འགྲོ་བས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་ཚད་མེད་པའོ། །
en: “Noble one, the bodhisattvas are immeasurable because through great prayers they are based upon every level in the ten directions of the realm of phenomena.

source: རིགས་ཀྱི་བུ་བྱམས་པ་ཆེན་པོས་འགྲོ་བ་ཐམས་ཅད་རྒྱས་པར་འགེངས་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་ཚད་མེད་པའོ། །
en: “Noble one, the bodhisattvas are immeasurable because through their great love they are spread among all beings.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པས་ཞིང་ཐམས་ཅད་དུ་བསྐལ་པ་ཐམས་ཅད་ཡོངས་སུ་སྡུད་པས། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་ཚད་མེད་པའོ། །
en: “Noble one, the bodhisattvas are immeasurable because through their bodhisattva conduct they include all kalpas in all realms.

source: རིགས་ཀྱི་བུ་ཏིང་ངེ་འཛིན་གྱི་སྟོབས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་ལམ་ལས་ཕྱིར་མི་ལྡོག་པས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་ཚད་མེད་པའོ། །
en: “Noble one, the bodhisattvas are immeasurable because through the power of samādhi they are irreversible on the bodhisattva path.

source: རིགས་ཀྱི་བུ་གཟུངས་ཀྱི་སྟོབས་ཀྱིས་འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་འཛིན་པའི་གཟུངས་ཀྱི་ཚུལ་ཁོང་དུ་ཆུད་པར་བྱེད་པས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་ཚད་མེད་པའོ། །
en: “Noble one, the bodhisattvas are immeasurable because through the power of retention they realize the way of retention that supports all beings.

source: རིགས་ཀྱི་བུ་ཡེ་ཤེས་སྣང་བའི་སྟོབས་ཀྱིས་དུས་གསུམ་གྱི་ཡེ་ཤེས་ཀྱི་ཚུལ། ཁོང་དུ་ཆུད་པར་བྱེད་ཅིང་། ཡང་དག་པར་འཛིན་པས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་ཚད་མེད་པའོ། །
en: “Noble one, the bodhisattvas are immeasurable because through the power of the radiance of knowledge they realize and possess the way of the knowledge of the three times.

source: རིགས་ཀྱི་བུ་མངོན་པར་ཤེས་པའི་སྟོབས་ཀྱིས་ཞིང་ཐམས་ཅད་དུ་སེམས་ཅན་རྣམས་ཀྱི་བསམ་པ་དང་། མོས་པ་ཅི་ལྟ་བ་བཞིན་དུ་འོད་ཀྱི་དྲ་བའི་འཁོར་ལོ་མངོན་པར་བསྒྲུབ་པས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་ཚད་མེད་པའོ། །
en: “Noble one, the bodhisattvas are immeasurable because through the power of clairvoyance they accomplish wheels of nets of light in accordance with the thoughts and aspirations of beings in all realms.

source: རིགས་ཀྱི་བུ་སོ་སོ་ཡང་དག་པར་རིག་པའི་སྟོབས་ཀྱིས་ཚིག་གཅིག་བརྗོད་ཀྱང་འགྲོ་བ་ཐམས་ཅད་ཤིན་ཏུ་ཚིམ་པར་བྱེད་པས། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་ཚད་མེད་པའོ། །
en: “Noble one, the bodhisattvas are immeasurable because through the power of discernment they can satisfy all beings by uttering just one word.

source: རིགས་ཀྱི་བུ་ལུས་རྣམ་པར་དག་པས། སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་རང་གི་ལུས་ཀྱིས་རྒྱས་པར་འགེངས་པས། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་ཚད་མེད་པའོ། །
en: “Noble one, the bodhisattvas are immeasurable because through the purity of their bodies they pervade all the buddha realms with their bodies.”

source: ནོར་བཟངས་ཀྱིས་སྨྲས་པ། འཕགས་མ་ཁྱོད་ཇི་སྲིད་ཅིག་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་འཚང་རྒྱ་བར་འགྱུར། །སྨྲས་པ་རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། སེམས་ཅན་གཅིག་ཅིག་ལ་དམིགས་ཤིང་གདུལ་བར་བྱ་བ་དང་། སྨིན་པར་བྱ་བའི་ཕྱིར།
en: Sudhana asked, “Āryā, at which twilight will you attain the highest, complete enlightenment of buddhahood?”

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་བྱང་ཆུབ་ཏུ་སྐྱེ་བ་མ་ཡིན་ཏེ། སེམས་ཅན་བརྒྱའི་ཕྱིར་མ་ཡིན། སེམས་ཅན་སྟོང་གི་ཕྱིར་མ་ཡིན། སེམས་ཅན་བརྒྱ་ཕྲག་སྟོང་གི་ཕྱིར་མ་ཡིན། སེམས་ཅན་བྱེ་བའི་ཕྱིར་མ་ཡིན། སེམས་ཅན་བྱེ་བ་བརྒྱའི་ཕྱིར་མ་ཡིན། སེམས་ཅན་བྱེ་བ་སྟོང་གི་ཕྱིར་མ་ཡིན།
en: Āśā answered, “Noble one, it is like this: bodhisattvas do not develop the aspiration for enlightenment with the intention of guiding and ripening one being, or a hundred beings, or a thousand beings, or a hundred thousand beings, or ten million beings, or a thousand million beings, or ten thousand million beings, or a trillion beings; nor does a bodhisattva develop the aspiration for enlightenment for the sake of a hundred thousand quintillion beings.
